InformationRegisters/АвтоматическоеУправлениеКампаниями.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.АвтоматическоеУправлениеКампаниями" category="Record">				<xr:TypeId>b5df9ff4-5d2a-4b72-938d-219852a6505b</xr:TypeId>				<xr:ValueId>7e381bd1-d30a-457b-b600-1b675fffe610</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.АвтоматическоеУправлениеКампаниями" category="Manager">				<xr:TypeId>01f87a85-260d-4e27-838d-a08c1012f8c4</xr:TypeId>				<xr:ValueId>b6a05fbb-456e-463e-822d-86db9d9ac6e7</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.АвтоматическоеУправлениеКампаниями" category="Selection">				<xr:TypeId>60c5bbc4-9e83-459e-9b6b-1a45d6cee1b5</xr:TypeId>				<xr:ValueId>70696a84-e834-49af-bba2-fc68249b2b71</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.АвтоматическоеУправлениеКампаниями" category="List">				<xr:TypeId>99200abd-496e-451b-8f14-36b8ee049a8b</xr:TypeId>				<xr:ValueId>35c07d87-5bf9-4486-9677-3d32e817082e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.АвтоматическоеУправлениеКампаниями" category="RecordSet">				<xr:TypeId>251b9ab5-65ce-4eb6-bd02-9ca423fd18cf</xr:TypeId>				<xr:ValueId>39737bea-fd45-4daa-b51a-efb33f6b24b3</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.АвтоматическоеУправлениеКампаниями" category="RecordKey">				<xr:TypeId>0f885a2b-95c7-414a-9d23-973e55c98c19</xr:TypeId>				<xr:ValueId>abdcdd1a-c789-40c6-8d8e-bf1f984e5c87</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.АвтоматическоеУправлениеКампаниями" category="RecordManager">				<xr:TypeId>0744c6de-4cad-475d-ad02-5e9ade9febe6</xr:TypeId>				<xr:ValueId>d87a6ec7-eea8-4850-90d8-83351363d680</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>АвтоматическоеУправлениеКампаниями</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Автоматическое управление кампаниями</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Automatic managing of campaigns</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm>InformationRegister.АвтоматическоеУправлениеКампаниями.Form.ФормаЗаписи</DefaultRecordForm>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Attribute>				<Properties>					<Name>Установить</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Установить</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Set</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:boolean</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue>true</FillValue>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>Снять</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Снять</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Remove</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:boolean</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>ФормулаОпределенияВозможностиВУправленииКампанией</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Формула определения возможности в управлении кампанией</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Formula of defining of possibilty in managing of campaign</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>0</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Dimension>				<Properties>					<Name>ТочкаРегистрации</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Точка регистрации</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Registration point</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиРегистрации</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>true</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>true</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Кампания</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Кампания</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Campaign</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Кампании</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>true</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>true</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Form>ФормаЗаписи</Form>		</ChildObjects>	</InformationRegister></MetaDataObject>

InformationRegisters/АвтоматическоеУправлениеКампаниями/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТочкаРегистрации.ТолькоПросмотр = Параметры.ЗначенияЗаполнения.Свойство("ТочкаРегистрации");
	Элементы.Кампания.ТолькоПросмотр = Параметры.ЗначенияЗаполнения.Свойство("Кампания");
	Действие = ?(Запись.Установить,1,0);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.Установить = Действие = 1;
	Запись.Снять = Действие = 0;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФормулаОпределенияВозможностиВУправленииКампаниейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Формула", Запись.ФормулаОпределенияВозможностиВУправленииКампанией);
	ОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеПроверкиФормулы", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент,,,,ОповещенияОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиФормулы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Запись.ФормулаОпределенияВозможностиВУправленииКампанией = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры // ПослеПроверкиФормулы()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
